INSERT INTO Tests (Title, Description)
VALUES 
('Історія', 'Історичні події ХІХ-ХХ ст.'), 
('Економіка підприємства', 'Світові столиці');

INSERT INTO Questions( Text, TestId)
VALUES 
( 'В кого на території України з’явився перший механічний пристрій – свердло для отворів у дереві та камені?', 1),
( 'Між 516 і 512 роками до н. е. персидський цар Дарій I Великий з військом вторгся у землі скіфів. Як закінчився цей похід?', 1),
( 'Слов’яни якого племені створили союз, що згодом став серцем Київської Русі?', 1),
( 'В якому сторіччі в літописах вперше з’являється слово «Україна» – як географічне позначення Київського порубіжжя?', 1),
( 'Який з князів невдало воював з Візантією, яка спалила його флот «грецьким вогнем», пограбував багаті міста на Каспії та був вбитий древлянами через надто велику данину?', 1),
( 'Слов’яни якого племені створили союз, що згодом став серцем Київської Русі?', 1),
( 'Яке місто першим отримало Магдебурзьке право – правову систему міського самоврядування?', 1),
( 'Чим прославився Дмитро «Байда» Вишневецький?', 1),
( 'Ну добре. А Ярема Вишневецький?', 1),
( 'Юрій Хмельницький, Павло Тетеря, Григорій Сагайдачний, Данило Апостол – хто з них не був гетьманом?', 1)
;

INSERT INTO Answers(Text, QuestionId, RightAnswer)
VALUES 
('Кроманьйонці', 1, 'FAlSE'),
('Трипільці', 1,'TRUE'),
('Сармати', 1, 'FAlSE'),
('Кіммерійці', 1, 'FAlSE'),

('Скіфи дали великій бій і виграли', 2, 'FAlSE'),
('Скіфи дали великий бій і програли', 2, 'FAlSE'),
('Скіфи використали тактику випаленої землі і Дарій змушений був піти', 2, 'TRUE'),
('Скіфи пішли на перемовини і переконали Дарія піти з щедрими дарами', 2, 'FAlSE'),

('Древляни', 3, 'FAlSE'),
('Кривичі', 3, 'FAlSE'),
('В’ятичі', 3, 'FALSE'),
('Поляни', 3, 'TRUE'),

('X', 4, 'FAlSE'),
('XI', 4, 'FAlSE'),
('XII', 4, 'TRUE'),
('XIII', 4, 'FAlSE'),

('Ігор', 5, 'TRUE'),
('Олег', 5, 'FAlSE'),
('Аскольд', 5, 'FAlSE'),
('Святослав', 5, 'FAlSE'),

('Другий літопис в історії наших земель', 6, 'FAlSE'),
('Послання Володимира Великого до Візантії', 6, 'FAlSE'),
('Кодекс законів Ярослава Мудрого', 6, 'TRUE'),
('Документ, що засвідчив об’єднання князів для боротьби з монголо-татарами', 6, 'FAlSE'),

('Київ', 7, 'FAlSE'),
('Львів', 7, 'TRUE'),
('Галич', 7, 'FAlSE'),
('Луцьк', 7, 'FAlSE'),

('Організував кілька військових походів на оттоманів, заснував Січ', 8, 'TRUE'),
('Створив Острозьку академію, де під його керівництвом було випущено Острозьке Євангеліє', 8, 'FAlSE'),
('Став першим головою реєстрового козацтва', 8, 'FAlSE'),
('Спричинив підписання унії, що мала об’єднати православ’я і католицизм', 8, 'FAlSE'),

('Полковник українського війська у Визвольній війні', 9, 'FAlSE'),
('Один з засновників Києво-Могилянської академі', 9, 'FAlSE'),
('Став гетьманом України після Богдана Хмельницького', 9, 'FAlSE'),
('Кривавий польський шляхтич, який воював проти Богдана Хмельницького', 9, 'TRUE'),

('Юрій Хмельницький', 10, 'FAlSE'),
('Павло Тетеря', 10, 'FAlSE'),
('Григорій Сагайдачний', 10, 'TRUE'),
('Данило Апостол', 10, 'FAlSE')
;

INSERT INTO Questions( Text, TestId)
VALUES 
( 'Економіка підприємства як наука вивчає:', 2),
( 'Підприємство - це:', 2),
( 'Що є основною метою діяльності підприємства ?', 2),
( 'Під матеріально-технічною базою сільського господарства розуміють:', 2),
( 'Енергоозброєність праці – це:', 2),
( 'Що є факторами виробництва ?', 2),
( 'Що включається у площу сільськогосподарських угідь?', 2),
( 'Урожайність - це:', 2),
( 'Як визначають урожайність продукції ?', 2),
( 'Основними фондами називаються:', 2)
;

INSERT INTO Answers(Text, QuestionId, RightAnswer)
VALUES 
('виробничі відносини між людьми та дію економічних законів у процесі виробництва;', 11, 'TRUE'),
('організацію праці та управління виробництвом;', 11,'FAlSE'),
('створення ринків у різних галузях народного господарства;', 11, 'FAlSE'),
('діяльність промислових підприємств', 11, 'FAlSE'),

('добровільне об’єднання осіб для спільної сільськогосподарської діяльності;', 12, 'FAlSE'),
('суб’єкт господарювання, що має право виробити товарну продукцію;', 12,'FAlSE'),
('суб’єкт господарювання, має право юридичної особи і здійснює свою діяльність з метою одержання прибутку;', 12, 'TRUE'),
('добровільне об’єднання осіб для обслуговування членів кооперативу.', 12, 'FAlSE'),

('раціональне використання землі;', 13, 'FAlSE'),
('оновлення і модернізація устаткування;', 13,'FAlSE'),
('одержання максимального прибутку;', 13, 'TRUE'),
('виробництво якісної продукції. ', 13, 'FAlSE'),

('сукупність всіх матеріально-технічних засобів, що забезпечують виробничу діяльність;', 14, 'TRUE'),
('засоби виробництва і трудові ресурси;', 14,'FAlSE'),
('частка високоефективних систем машин;', 14, 'FAlSE'),
('частка машин на основі електрофікації.', 14, 'FAlSE'),

('кількість використаної електроенергії на виробничі цілі на 1 гапосівної площ;', 15, 'FAlSE'),
('кількість енергоресурсів, що припадає на 1 га посівної площі;', 15,'FAlSE'),
('кількість енергоресурсів, що припадає на одного середньооблікового працівника;', 15, 'TRUE'),
('кількість електроенергії в розрахунку на одного середньорічного працівника.', 15, 'FAlSE'),

('соціальна інфраструктура;', 16, 'FAlSE'),
('продуктивність праці;', 16,'FAlSE'),
('робоча сила, засоби праці, предмети праці, земля', 16, 'TRUE'),
('природно-кліматичні умови', 16, 'FAlSE'),

('рілля, сіножаті, пасовища, багаторічні плодові насадження;', 17, 'TRUE'),
('рілля, багаторічні насадження, ставки;', 17,'FAlSE'),
('рілля, площа лісу;', 17, 'FAlSE'),
('рілля, сіножаті, пасовища, заболочені угіддя.', 17, 'FAlSE'),

('відношення валового збору до площі ріллі;', 18, 'FAlSE'),
('кількість продукції отриманої з 1 га зібраної площі;', 18,'TRUE'),
('продукція зернових культур на 100 га ріллі;', 18, 'FAlSE'),
('валовий збір з площі сільськогосподарських угідь.', 18, 'FAlSE'),

('шляхом ділення площі на валовий збір;', 19, 'FAlSE'),
('шляхом ділення валового збору на площу посіву;', 19,'FAlSE'),
('шляхом ділення валового збору на зібрану площу;', 19, 'TRUE'),
('шляхом ділення валового збору на планову площу посіву.', 19, 'FAlSE'),

('засоби праці, що багаторазово беруть участь у виробничому процесі без зміни натуральної форми і переносять по частинах свою вартість на новостворений продукт по мірі зносу;', 20, 'TRUE'),
('засоби виробництва, вартість яких переноситься на продукт, і повертається підприємству протягом одного кругообігу;', 20,'FAlSE'),
('знаряддя праці, виражені у вартісній формі;', 20, 'FAlSE'),
('фонди, що беруть участь у процесі виробництва і формуванні вартості продукції.', 20, 'FAlSE')
;